IDEA StatiCa Open Model
HingeTypeInDirrection Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of hinge in the direction
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum HingeTypeInDirrection
Public Enumeration HingeTypeInDirrection
public enum class HingeTypeInDirrection
Members
Member name | Value | Description
NoHinge | 0 |  No hinge defined
FullHinge | 1 |  Full hinge, zero stiffness is aplied
Flexible | 2 |  Initial stiffness is aplied
Nonlinear | 3 |  Nonlinear function is aplied
See Also
Reference
IdeaRS.OpenModel.Model Namespace